<blank>
<s>
</s>
WHITESPACE
NEWLINE
.
{
}
)
(
;
public
,
System
'
/
LINE
MESSAGE
<
>
-
FILE_CONTENT
TARGET_LINES
=
2
null
//
throw
int
REPLACE
SOURCE_LOCATION
bool
3
:
1
"
string
class
static
4
the
summary
private
]
[
get
void
0
partial
name
in
T
Collections
type
to
readonly
?
ADD
PREVIOUS_SOURCE_LOCATION
override
object
value
be
5
should
6
with
is
parameter
object?
default
Runtime
Threading
_dummyPrimitive
protected
field
sealed
have
if
byte
string?
obj
Equals
a
member
Generic
abstract
using
has
doesn't
false
virtual
documentation
Tasks
use
explicit
const
_dummy
struct
empty
this
remove
new
i
namespace
Microsoft
as
Serialization
Diagnostics
it
access
enum
method
o
not
property
set
add
internal
of
base
CodeAnalysis
SymDocument
char
change
param
ComponentModel
IEnumerable
AttributeTargets
|
IntPtr
comment
declared
Security
an
Extensions
true
ref
Net
unused
been
REMOVE
SOURCE_LOCATION_START
SOURCE_LOCATION_END
return
Attribute
array
cancellationToken
var
order
match
identifier
7
item
t
or
instead
no
line
message
short
equals
cookie
contains
GetHashCode
format
*
IDisposable
CancellationToken
must
convert
strRemaining
Task
for
IConvertible
IFormatProvider
Primitives
WriteLine
index
modifier
are
IEnumerator
InteropServices
provider
CopyTo
Int32
ICollection
NotNullWhenAttribute
Principal
comments
ownsHandle
out
auto
source
modifiers
8
Name
single
just
noise
mmlaj
lowercase
letters
StringSegment
9
suboptimal
formatting
members
ValueTask
Cookie
Add
IEquatable
IO
that
flags
Contains
TKey
IList
str
other
underscore
IdentityReference
documented
+
$
correctly
Dispose
offset
ParseString
from
returns
between
Program
List
==
starts
interface
SampleInfo
tid
part
declarations
under
~
Inherited
Console
uint
Type
Exception
MaxValue
MinValue
fLogging
StreamingContext
!=
GetObjectData
Action
context
analyzer
SerializationInfo
ChecksumType
named
Roslyn
generated
attribute
declaration
IChangeToken
BitVector32
EventArgs
_pascalcase
writer
ReturnValue
destination
WeakReference
TextWriter
length
@"
Specialized
Length
_tid
Checksum
Message
icollection
Dictionary
info
++
decorated
Value
buffer
PerfMapWriter
IsInvalid
replace
DateTime
need
you
_writer
ushort
specify
Text
license
Count
begin
Current
TResult
open
MIT
strStart
decimal
state
one
MaxType
Empty
SymChecksumType
Foundation
SafeHandleMinusOneIsInvalid
ToDateTime
\
idealProcNo
!
DateTimeOffset
ToBoolean
^
startIndex
Object
rva
file
WebSockets
AttributeUsageAttribute
methods
NET
_flags
#if
Specifies
ArraySegment
UInt64
ReadOnlySpan
countSamples
classes
Property
see
TValue
ToChar
by
operator
Remove
Boolean
#endif
specifying
IPathSegment
s
GetEnumerator
finalizers
remarks
Flush
Thread
SafeFileHandle
copyto
cref
String
make
p
Format
Newtonsoft
Json
AllocHeap
does
long
count
CompareTo
braces
m
zA
Z0
SYSTEM_PRIVATE_CORELIB
#else
constructor
strEnd
_array
strTemp
procsPerNode
identity
AccessViolationException
_pdbExtraData
ReleaseHandle
consider
Section
_tempSourceDllName
IsReadOnly
Gets
AggregateException
StringComparison
TaskScheduler
datetimeoffset
arrayindex
CriticalHandle
_allocHeap
_countSamples
more
FileSystemGlobbing
SafeHandle
on
ReadOnlySequence
CriticalHandleMinusOneIsInvalid
handle
IComparer
ObsoleteAttribute
PDBExtraData
SequencePosition
IAsyncResult
This
_idealProcNo
PdbWriter
async
differs
Func
SystemException
_pdbFilePath
DataAnnotations
letter
even
inner
valuetype
written
TState
target
text
case
usage
HeapBalanceFlagMask
Array
x
licenses
ulong
+=
dummy
Buffers
WebSocketMessageType
y
Default
TargetFrameworkName
AppDomainUnloadedException
ToString
event
strThreadIndices
b
strRest
marked
non
statements
values
corresponding
methodName
declare
Clear
_pdbPath
AllowNullAttribute
identityreference
Enumerator
_symDocuments
BrowsableAttribute
allocHeap
argument
redundant
NGEN
PDB
explicitly
returnValue
PassOneViewType
foreach
OMF
CriticalHandleZeroOrMinusOneIsInvalid
do
MethodInfo
ContinueWith
TaskContinuationOptions
continuationOptions
scheduler
Byte
ISerializable
StringSegmentComparer
AsSpan
asyncResult
DisallowNullAttribute
where
any
double
agreements
key
variable
strRet
procIndex
means
uninit
code
we
defined
changeTokenProducer
so
unsafe
UInt16
ApplicationBase
remark
store
nodeIndexToPrint
DiagnosticId
RegularExpression
SafeHandleZeroOrMinusOneIsInvalid
DiaSymReaderLibrary
MarshalAs
DiaSymReader
CaseInsensitiveComparer
Compare
_ngenWriter
BitArray
Unsafe
byteOffset
IDictionary
iSection
implicitly
BinaryWriter
Parameter
elementOffset
timeUnitMS
ValueWebSocketReceiveResult
qpfAdjusted
Component
IdentityReferenceCollection
Win32Exception
output
StringValues
Win32
SafeHandles
ToDecimal
cb
datetime
Native
callback
totalNodes
Please
None
All
MaybeNullAttribute
The
NotNullAttribute
destructor
Claim
IReadOnlyList
typeof
expression
UnmanagedType
time
_current
properties
%
CaseInsensitiveHashCodeProvider
ReadOnlyMemory
and
preexistingHandle
alloweded
ms
AddByteOffset
KeyValuePair
existingHandle
c
IdentityNotMappedException
xf
EnterDueToProc
xf0
lower
may
#
ClaimsIdentity
Assembly
startTimeMS
RegisterChangeCallback
changeTokenConsumer
OSPlatformAttribute
Linq
compare
>>
DisposeAsync
strCellFormat
ISpanFormattable
totalNodesRead
EncodingProvider
uFFFF
'\0'
threadMapping
qpcStart
swPassZero
regexconverter
innerException
FileStream
seal
events
indexers
CookieCollection
statement
Char
pIndex
follow
naming
conventions
element
disposing
IEqualityComparer
Write
current
JsonConverter
Converters
RegexConverter
regularexpress
CompositeChangeToken
position
sections
Path
CompilerServices
ArgIterator
duplicate
allows
IComparable
token
AddSection
Substring
invalid
typeparam
ILCompiler
CancellationChangeToken
nuint
ptr
Claims
Parse
Capacity
destinationindex
SHA_256
names
qpf
totalProcs
MutipleProcs
Async
Memory
StringComparer
Comparer
dllPath
Internal
isILPDBProvided
can
DefaultInvariant
path
suffix
SafeWaitHandle
comparand
DllNotFoundException
TItem
className
UInt32
OnChange
Globalization
assemblyName
strAllocHeap
only
ApplicationException
StreamWriter
_ownsHandle
each
prefer
parameters
end
start
pattern
UIntPtr
messageType
endOfMessage
WebSocket
claims
Field
comparisonType
n
IPattern
node
strAlloc
FlagsAttribute
threadsSeenTotalOrdered
IAsyncDisposable
ArrayWithOffset
built
blank
CanProduceStem
UnmanagedMemoryAccessor
ReadAsync
try
cookiecollection
cookies
assignment
catch
_strThreadIndices
will
platformName
_values
removed
perfMapFileName
Translate
AddSymbol
BStr
pSymbol
currentArg
proc
xf00
HybridDictionary
when
capacity
Copy
calls
zero
comparer
totalAllocThreads
log
span
CookieContainer
10
Remoting
http
Ordinal
IComponent
WriteTo
||
section
LiteralPathSegment
StringBuilder
As
currentSample
SetIdeal
contain
objA
objB
GetType
serializationInfo
endTimeMS
TAwaiter
TStateMachine
arrayIndex
CancelEventArgs
DynamicallyAccessedMemberTypes
PublicParameterlessConstructor
interpolation
passing
samples
points
wrong
continuationAction
nameof
parentheses
_stringTableToOffsetMapping
schemas
continuationFunction
TrackResurrection
fieldName
MissingMemberException
BestFitMapping
_currentKey
strThread
trackResurrection
&&
EndWrite
flushToDisk
totalGCCount
Rune
primitive
getAsync
ActiveChangeCallbacks
maxlength
streamingContext
assembly
alias
EndsWith
Flags
fileIndex
SHA1
pass
PatternTestResult
DefaultValueAttribute
DirectoryInfoBase
ParseThreadIndices
kPDBLines
separators
PlatformName
symbol
EventHandler
StartsWith
Justification
targetType
CategoryAttribute
Total
local
Uri
Licensed
DataMisalignedException
MaxLength
Stream
lines
replaced
_stemItems
arraysegment
User
Most
MD5
txt
mark
Abstractions
sequence
compareto
FalseString
TrueString
AppDomainSetup
linkedlist
present
ComInterfaceType
InterfaceIsIUnknown
FullName
GetService
SequenceReader
_documentToChecksumOffsetMapping
parse_hb_log
xmlsoap
strTI
procStart
ISymNGenWriter
SyncRoot
Members
CharSet
ThrowOnUnmappableChar
WriteAsync
system
Adds
space
ThrowHelper
ContextStaticAttribute
serializationinfo
streamingcontext
ICHANGETOKEN
DllImportSearchPath
pre
increment
decrement
newly
ArrayBufferWriter
Segments
0s
_lastTimeUnit
_sampleCount
_strAllocHeap
args
strPassZeroLog
1000
EditorBrowsableState
CreateSection
iCodeSection
_value
ArgumentNullException
CLSCompliantAttribute
whitespace
#pragma
warning
disable
SuppressUnmanagedCodeSecurityAttribute
mscorlib
ws
strings
MemberAccessException
your
userData
error
AccessControl
read
missing
HashSet
GCs
Offset
indicating
whether
HasChanged
advertencia
replacing
box
libraryName
WebSocketState
X8
IPatternContext
LogPassZeroAggregatedSample
ThreadStaticAttribute
_separators
sample
assigning
@object
integer
_pdbMod
CallingConvention
check
could
incorrectly
overloaded
usingResourceKeys
https
go
ChangeTokens
instance
example
switched
IDictionaryEnumerator
caseinsensitivecomparer
icomparer
releases
ExcludeFromCodeCoverageAttribute
Int16
formatString
ChunkEnumerator
IHashCodeProvider
dharmendra
testing
loop
SizeOf
NoopDisposable
types
else
IsAscii
_currentValue
strHeader
BFR
totalGCDurationMS
totalAllocMB
ClassInterfaceType
strAfterTID
resourceString
StringRuneEnumerator
Read
containing
dummyPrimitive
release
disallows
mapping
checked
Zero
pmod
destinationIndex
maxValue
peReader
Const_Read
WriteMethodPDBData
IsDefaultAttribute
pdbSectionNumber
used
disposables
RuntimeArgumentHandle
arglist
_onChangeDelegate
disallowed
input
deprecated
Constructor
multiple_procs_p
org
EditorBrowsableAttribute
alloc_count_p
cancellationtoken
ISymNGenWriter2
future
TFrame
UnmappedIdentities
Version
Mask
disposeasync
qpc
substract
failed
ObjectModel
_comparisonType
OrdinalIgnoreCase
while
ThrowArgumentNullException
ExceptionArgument
sr
strTID
SupportedOSPlatformAttribute
MaybeNullWhenAttribute
condition
MissingMethodException
ModuleHandle
End
DllImportResolver
searchPath
params
FreeCapacity
CanWrite
alloc
upper
ApplicationId
includes
HandleRef
separated
_innerStream
identityreferencecollection
GetAdjustedProcIndex
AppContext
Resources
CancellationTokenSource
Load
microsoft
com
AsyncState
service
Initializes
combination
strGCRange
into
MissingFieldException
SecurityIdentifier
IsError
eventhandler
result
Enum
IIdentity
AUTHORITY
MarshalByRefObject
StringTokenizer
avg
MessageType
threadsSeenTotal
OrderByDescending
dictionary
prefix
uri
TTo
TFrom
PathSegments
Close
document
PathAndQuery
Versioning
exception
DBNull
OutStream
AllowReversePInvokeCallsAttribute
Subtract
_chars
BinaryReader
reader
libraryHandle
precedence
GC
WebSocketCloseStatus
changeTokens
unnecessary
IRaggedPattern
thread
lastThreadICount
ChangeToken
right
Never
TimeSpan
previous
holder
but
neither
nor
notinheritable
Process
Machine
_index
IndexOf
aggregated
unknownDocument
largestTimeInBetweenGCs
_disposables
Set
checksum
Reflection
Class
trailing
INotifyCollectionChanged
CollectionChanged
ObjectHandle
strPassOneLog
Combine
API
_disposable
ClaimsPrincipal
formatter
ClassName
MemberName
Signature
collection
DefaultIssuer
implicit
domain
FlushAsync
calculate
procEnd
CoreNewLine
total
OutputTabsAsync
KeyedCollection
HasFlag
otherwise
minus
_DummyPrimitive
UNSAFE
initialSize
AllocMB
heap
_pos
ParameterName
CULong
last
usedEntryCount
get_Task
AwaitOnCompleted
awaiter
closing
brace
followed
before
PollingWildCardChangeToken
CanRead
DynamicallyAccessedMembersAttribute
implement
interfaces
connector
contracts
elements
authenticationType
Comparison
PEReader
PatternContexts
We
compress
stores
FrameData
IsNotApplicable
parenthesis
aggregatedSampleCount
apply
restriction
PauseTimePercentage
i++
InMemoryDirectoryInfo
timeUnits
CultureInfo
culture
HttpStatusCode
map
supported
_callbackLock
made
ReservedMask
RTSpecialName
fwlink
linkid
14202
DomainMask
MultiDomainHost
DefaultCookieLengthLimit
ComImportAttribute
ClearPrivatePath
nint
CLong
FileInfoBase
WrittenCount
unmanaged
preceded
_strGCRange
dashIndex
HashHelpers
NFloat
turned
totalTimeUnits
StandardText
Const_F32Bit
SuppressUnmanagedCodeSecurity
delegate
directly
_state
binaryForm
DictionaryBase
BestFitMappingAttribute
commented
ILinearPattern
CreateLogValuesFormatter
expectedNamedParameterCount
making
AsTask
ConfigurationReloadToken
AsMemory
LOCAL
OffendingNumber
forceSuccess
omitted
AllowNull
left
MyDocuments
Personal
Match
IsSynchronized
SpecialFolder
SetEnvironmentVariable
PrivateScope
ReuseSlot
Encoding
GetEncoding
codepage
ObservableCollection
NullChangeToken
MemberNotNullWhenAttribute
DayOfWeek
formats
DateTimeStyles
Method
procs
RequestCacheLevel
Authentication
ExtendedProtection
SafeAccessTokenHandle
SpecialFolderOption
Printing
28
1074
0ms
TypeConverterAttribute
ComMemberType
DynamicallyAccessedMembers
0.0
totalBudgetMB
HttpRequestUrl
DateTimeKind
Unspecified
AddressFamily
endIndex
AuthenticationLevel
getobjectdata
PollingFileChangeToken
CollectionBase
DescriptionAttribute
timeIndex
Tridion
Contracts
IValueObject
restrict
caseInsensitive
argiterator
Span
Slice
culong
extern
literal
Anonymous
FileMode
Open
PEStreamOptions
compositeChangeTokenState
applicationid
x0001
Const_Write
textSectionOffset
lastProcIndex
icomparable
ICloneable
isSuccessful
Stem
MaxBinaryLength
AddLast
multiple
indicates
NetStandard1
AppendPrivatePath
clong
FileInfo
there
NotifyCollectionChangedAction
NotifyCollectionChangedEventHandler
CreateInstance
strIncludeAll
fIncludeAllTime
ia1
ia0
strLogNameWithoutExtension
pass1
nfloat
InterpolatedStringBuilder
LinkedListNode
RemoveFirst
RemoveLast
parent
Insert
IPrincipal
disk
ExternalException
PropertyChanged
INotifyPropertyChanged
FilePatternMatch
usings
collections
2005
05
NTAccount
DesignerCategoryAttribute
all
pdbFilePathBuilder
IsOpen
IReadOnlyCollection
swPassOneFiles
CookieException
nullable
WildcardPathSegment
threadsSeen
ListDictionary
WebSocketException
detected
ValueTuple
Query
keyword
legit
resourceKey
PEHeaders
SectionHeaders
Collection
builder
remaining
windows
safe
_
Null
associated
needs
nulls
Unbox
dst
subject
arithmetic
expressions
CreateNGenPdbWriter
LPWStr
AccessDenied
SafeBuffer
FileAccess
sortedlist
ContainsValue
GetByIndex
cancel
IChangeTracking
|=
currentArgValue
initialized
its
receiveBufferSize
PatternContextRagged
pascalcase
_cancellationTokenSource
StemItems
RemoveAt
DesignerSerializationVisibility
stem
DesignerSerializationVisibilityAttribute
after
whenever
across
tools
IP
ranges
x00000001
available
s_usingResourceKeys
TryGetSwitch
UseSystemResourceKeys
DefaultCookieLimit
ApplyPolicy
WrittenMemory
typeName
Flatten
ClaimTypes
h1
h2
TEMP
OperationCanceledException
ComImport
InterfaceType
Guid
FileSystemInfoBase
_changeTokenProducer
inheritdoc
SetLastError
Struct
HttpStyleUriParser
threadsSeenPerTimeUnit
Stack
IAsyncEnumerator
MoveNextAsync
max
StructuralComparisons
PatternContextLinear
segment
hcp
readonlyattribute
CollectionExtensions
these
generic
linq
threadsToPrint
DefaultNameClaimType
IsChanged
finally
Cookie.ctor
ComponentCollection
OutputTabs
No
sampleinfo
Delegate
WebSocketError
IsLittleEndian
balancing
logic
paramref
strCount
FormatCount
Unknown
PatternBuilder
CommentUri
designerType
OffsetOf
SR
initializing
Fragment
AbsoluteUri
TypeLoadException
disposable
dispose
Append
call
T1
logger
DestroyStructure
AsyncIteratorStateMachineAttribute
Handle
per
SchemeAndServer
TElement
AccessControlType
critical
NOTNULLATTRIBUTE
limit
claim
ALLOWNULLATTRIBUTE
IPATHSEGMENT
DISALLOWNULLATTRIBUTE
create
MoveNext
_Array
_Dummy
MAYBENULLATTRIBUTE
NativeLibrary
BeginsWith
appear
AceType
Pattern
wrapper
Missing
unknown
Failed
_files
File
SegmentGroup
SegmentGroupIndex
formatProvider
AppDomain
FileInfoWrapper
Actor
Numerics
Hashing
allocheap
countsamples
list
ToByte
AssemblyName
assigned
_changeTokenConsumer
WellKnownSidType
PatternContext
ts
Binary
serviceType
FileStyleUriParser
AccessRule
AuthorizationRule
EvidenceBase
Yes
idealprocno
_disposedSentinel
ChangeTokenRegistration
FormatException
unit
set_ideal_p
TryGetValue
NotNullIfNotNull
constructors
InStem
concrete
through
NameObjectCollectionBase
IDeserializationCallback
investigate
WebSocketContext
issuer
Port
BaseStream
WebSocketReceiveResult
memory
ReadLine
IBufferWriter
init
_registeredCallbackProxy
Comment
MatcherContext
gc
suppressfinalize
inside
FormatArgument
min
InMemoryFileInfo
An
dll
_preexistingHandle
SuppressFinalize
ex
IOrderedEnumerable
_existingHandle
STRINGSEGMENT
binary
parse
GC_alloc_mb
Concat
int>
parameterName
what
recorded
stateMachine
GetSpan
initialCapacity
AccessAllowed
pbSym
ModAddSecContribEx
isect
X2
PrintToAllPassOneFiles
WindowsBuiltInRole
Guest
Cancel
Domain
couldn't
find
readasync
AsPointer
sendBufferSize
bitvector32
ClaimsIdentity.ctor
nameType
roleType
simplify
extracting
invocation
results
variables
rvaOfTextSection
matching
Frame
Hidden
PauseDurations
PinnedObjectsCount
initializers
SizeOfRawData
IsSuccessful
BStrWrapper
WrappedObject
Winapi
Cdecl
PrintHeader
dateTime
GenericAcl
block
Delete
strLog
perDomainCapacity
maxCookieSize
SocketAddress
Serialize
Continue
SwitchingProtocols
BacktrackAvailable
SegmentIndex
SpecialName
EventInfo
MemberInfo
DefaultPerDomainCookieLimit
InterfaceIsDual
ParentDirectory
get_CompletedTask
CompletedTask
TaskCreationOptions
CreationOptions
Propagates
notifications
occurred
AceQualifier
GenericParameter
'-'
2009
09
actor
AppendLiteral
16
Const_FSel
Const_Exec
0x10D
SentinelType
Const_FAbs
0x208
B029E51B
4C55
4fe2
B993
9F7BC1F10DB4
MinBinaryLength
ToDouble
UnmanagedFunctionPointerAttribute
Interface
SetItem
OriginalIssuer
CustomSerializationData
Xor
StructuralComparer
PropertyChangedEventHandler
DefineScope
LogValuesFormatter
Represents
IsFixedSize
MovedPermanently
Redirect
IsValidTargetType
get_Completion
ConcurrentExclusiveSchedulerPair
taskScheduler
maxConcurrencyLevel
maxItemsPerTask
Completion
ConcurrentScheduler
A
StructuralEqualityComparer
GetValueOrDefault
ParseGCRange
NotFiniteNumberException
AcceptChanges
program
accessMask
AreSame
accessibility
Programs
Favorites
Startup
Appearance
EnvironmentVariableTarget
Desktop
EventHandlerList
Success
MethodAttributes
Private
FamANDAssem
SubtractByteOffset
MethodToken
HotRVA
uint64
MemberNotNullWhenAttribute.ctor
promised
ᵐ
meaning
were
going
f2
styles
Sunday
Monday
nodes
fCheckThreadIndex
ChannelBinding
GetChannelBinding
ChannelBindingKind
kind
Cache
BypassCache
now
CommonOemLinks
CDBurning
classInterfaceType
Discard
notnull
90
83
56
89
43
InterfaceIsIDispatch
InterfaceIsIInspectable
PropGet
DesignerAttribute
designerBaseType
WindowsAccountType
ThrowIfDisposed
dictionaryCreationThreshold
EndOfMessage
_parent
GetResourceString
defaultString
enable
NETSTANDARD1_0
NETSTANDARD1_1
NET45
defaultValue
NativeErrorCode
Token
CreateLinkedTokenSource
QPF
adjusted
QPC
DefaultRoleClaimType
role
counts
style
Utc
syntax
discouraged
RefreshProperties
RemoteCertificateNameMismatch
RemoteCertificateChainErrors
Sockets
Adding
options
data
genericArguments
lock
AccessControlModification
attributeusageattribute
MutualAuthRequested
identitynotmappedexception
T2
Split
','
StringSplitOptions
RemoveEmptyEntries
Reset
PatternContextLinearExclude
AssemblyLoad
stateMachineType
WindowsIdentity
predicate
k
UserInfo
Host
multiply
TInterface
GetComInterfaceForObject
WritePDBDataHelper
web
socket
sym
lastTimeUnit
sampleCount
mod
u
PATTERNCONTEXTRAGGED
FRAMEDATA
extensions
register
PATTERNCONTEXTLINEAR
AttributeUsage
AllowMultiple
TAB
represents
Unbox's
WriteUnaligned
SetDllImportResolver
ThrowOnInvalidState
validStates
NormalClosure
EndpointUnavailable
sizeHint
BuffersExtensions
DefaultDllImportSearchPaths
AssemblyDirectory
SafeDirectories
DllImport
PreserveSig
ngenImagePath
ModAddSymbols
LPArray
allSegments
passOneFileTypes
PatternContextRaggedExclude
KeyComparer
nameSuffix
lastThreadMCount
lastThreadPCount
strIdealProc
Aside
writing
also
prints
DirectorySeparators
DirectorySeparatorChar
AltDirectorySeparatorChar
necessary
AclRevision
AclRevisionDS
IContainer
Framework
decide
instances
Void
ppmod
_fileInfo
resource
T8
arg8
T9
arg9
Activator
according
_includePatterns
IOrderedDictionary
api
sender
e
CanRaiseEvents
PrintAllocToAllPassOneFiles
at
least
etc
MaxDefined
like
DirectoryInfoWrapper
implementation
DirectoryInfo
_directoryInfo
_isParentPath
_stack
wszObjFile
movenextasync
Issuer
GenericAce
PatternContextLinearInclude
ILogger
LogValues
GetFileNameWithoutExtension
EqualityComparer
Found
RedirectMethod
SeeOther
IEditableObject
BeginEdit
CancelEdit
Allow
Deny
break
TrimStart
_declaredLiteralFileSegments
Policy
files
category
CloseAllPassOneFiles
Connecting
IReadOnlyDictionary
NotImplementedException
dllNameWithoutExtension
browsable
bodied
IdentityNotMappedException.ctor
InvalidMessageType
Basic
WritePDBData
given
As's
DateOnly
InsertLineBreaks
BitConverter
DoubleToInt64Bits
HotLength
t1
t2
FromBinary
dateData
heaps
threads
currently
running
directives
registraton
unchecked
continue
KeysCollection
PatternContextRaggedInclude
InvalidHandle
MemoryPool
writeasync
Win32Exception.ctor
TSource
table
To
filled
later
Position
ComparisonType
Take
copy
checks
remain
valid
overwritten
ReadOnlyCollectionBase
AggressiveInlining
intentionally
creating
MatchAll
CurrentPathSegment
MultipleChoices
Moved
_root
_includePatternContexts
arg1
BeginScope
fileInfo
ValueWebSocketReceiveResult.ctor
fields
LinearPattern
Shared
innerType
RaggedPattern
ResolveEventHandler
AssemblyResolve
InvalidAsynchronousStateException
pdbPath
pdbExtraData
_declaredParentPathSegment
_declaredWildcardPathSegment
ordered
representation
CopyBlock
byteCount
RecursiveWildcardSegment
strAllocLine
IDispatchConstantAttribute
ContextMarshalException
KeyCollection
Util
bit
NotSupportedException
MemoryExtensions
StreamReader
Lookup
library
minTimestampMS
InsertItem
ChangeItemKey
_slashes
'/'
'\\'
win32exception
justification
ImmutableArray
SectionHeader
FILEINFOBASE
FILESYSTEMINFOBASE
PATTERNCONTEXT
EXTENSIONS
_ComparisonType
Hcp
write
rule
CANCELLATIONCHANGETOKEN
IPATTERN
off
dw
IdealProcNo
Tid
CountSamples
DIRECTORYINFOBASE
PropertyChangedEventArgs
_IsLittleEndian
CHANGETOKEN
COMPOSITECHANGETOKEN
HybridDictionary.ctor
allocated
MB
following
budgetMB
These
subscript
chars
KeyValuePair<string,
Grow
Claim.ctor
NotNullIfNotNullAttribute
Applied
root
SystemAudit
SystemAlarm
Join
CreatePatternContextForInclude
strLine
Administrator
fPrintThreadInfoPerTimeUnit
15900
AsRef
CreateClientWebSocket
innerStream
subProtocol
keepAliveInterval
useZeroMaskingKey
internalBuffer
Clone
Visible
here
totalprocs
totalnodes
procspernode
SectionCharacteristics
Container
len
AceEnumerator
CookieContainer.ctor
Debug
Assert
CloseMod
ExceptionResource
Enumerates
FailedAccess
AuditFlags
GetResourceText
GetBaseException
CloseOutputAsync
closeStatus
statusDescription
CreateClientBuffer
Matcher
Scope
_currentScope
N
ReadByte
greater
than
WinBuiltinTerminalServerLicenseServersSid
constant
Declare
RemoveItem
ReadOnlyDictionary
AllAccess
MaximumAllowed
NullSid
WorldSid
genericace
CreateFromBinaryForm
GetBinaryForm
originalDllPath
PatternMatchingResult
TryGet
sort
NETCOREAPP
NETSTANDARD2_1
IServiceProvider
WriteByte
Inner
UpdateCallCount
nameof(Component)
tokenizer
_declaredLiteralFolderSegmentInString
_declaredLiteralFolderSegments
structure
final
directories
deleted
don't
successfully
notsupportedexception
notimplementedexception
ported
crossgen
yet
AccessViolationException.ctor
this[]
gr
GCRange
SetCookies
cookieHeader
observed
during
comma
multi
ReadOnlyObservableCollection
LiteralParent
CreateReadStream
endsWith
consumer
Browsable
OnChangeTokenFired
DllImportAttribute
DllNotFoundException.ctor
>=
--
D682FD12
43dE
411C
811B
BE8404CEA126
values1
values2
uppercase
Asynchronous
xFFFFFFFF
WrittenSpan
GetCookieHeader
NetworkAuthenticationRequired
HttpVersion
Version10
PrivateBinPath
ClearShadowCopyPath
ShadowCopyDirectories
_excludePatterns
_builder
_comparison
ConnectionClosedPrematurely
InvalidState
MandatoryExtension
InternalServerError
swpasszero
Ratio
generates
logs
Date
GetAssemblyEnumerator
GetAssemblyEvidence
SkipInit
IStructuralComparable
IStructuralEquatable
ITuple
DesignerAttribute.ctor
WinCapabilitySharedUserCertificatesSid
WinCapabilityEnterpriseAuthenticationSid
WinCapabilityRemovableStorageSid
Normal
ia
IncludeAll
bitwise
operation
GetLocalizedString
ParentPathSegment
SetAll
Queue
Prelink
Enumerable
SecurityRuleSet
ModuleResolve
bits
startOfStringTableOffset
MemberNotNullAttribute
ie
isn't
higher
PrintProcActivityOnNode
was
CC_MSCPASCAL
CC_PASCAL
components
IsCancellationRequested
ReadInt64
sbyte
ReadSByte
formattedValues
token1
token2
ContainsKey
IOrderedEnumerable<KeyValuePair<int,
int>>
Buffer
2008
06
Volatile
If
called
immediately
wanna
compressing
same
Values
IsNullOrEmpty
CreateServerBuffer
wszModule
because
Data
CustomAce
GetGenericArguments
avoided
orleans
environment
View
Change
x0C00
Const_FGroup
x1000
Const_ReservedBits3
xE000
flogging
_excludePatternContexts
StrongPort
HostAndPort
Properties
arg2
l
Log
PhysicalFilesWatcher
comparison
Char[]
[]
typed
creation
beginIndex
poolArray
ArrayPool
Rent
Math
Max
additionalCapacityBeyondPos
GetObject
OriginalFormat
AssemblyLoadEventHandler
which
structuretype
archSuffix
UnhandledException
alphabetically
namespaces
description
procIndexBase
optimized
perfMapWriter
StateMachineAttribute
Unsafe.AddByteOffset
test
AuditRule
CloseStatus
formattedValue
AD
userToken
fieldsAlloc
CustomConstantAttribute
enumerator
shifting
multiplication
nesmath
two
numbers
algorithm
run
nes
cpu
managed
IGrouping
ILookup
Ambiguous
isInherited
InheritanceFlags
inheritanceFlags
PropagationFlags
propagationFlags
MatcherExtensions
GetDirectoryName
ni
GetExtension
T3
&=
newKey
qpfadjusted
KeyValuePair<int,
Marshal
FinalReleaseComObject
Owner
Group
ti
ThreadIndices
coalesce
conditional
UnmanagedMemoryAccessor.ctor
_star
'*'
StringComparisonHelper
ILINEARPATTERN
NotifyCollectionChangedEventArgs
IRAGGEDPATTERN
AssemblyLoadEventArgs
ResolveEventArgs
ENUMERATOR
Module
Event
IPATTERNCONTEXT
&
TestMethod
allocMB
reference
dwCharacteristics
dwDataCrc
crc
dwRelocCrc
peStream
_Files
acl
revision
unmappable
ordinal
container
yes
disposedSentinel
_IsNotApplicable
hot
best
fit
Parse_hb_log
FILEPATTERNMATCH
perf
onChangeDelegate
callbackLock
cancellationTokenSource
registeredCallbackProxy
wsz
Scheme
NESMath
Multiply
path2
length++
seperator
verbatim
IsStartingGroup
x2089
Expired
10000000
17262240813778
1726224081
Get
UnixEpoch
year
Rights
Trim
trimElement
s_usingresourcekeys
susingresourcekeys
_onchangedelegate
onchangedelegate
IFormattable
argument_invalidoffsetlength
argumentinvalidoffsetlength
argument_invalidoffsetlengthstringsegment
argumentinvalidoffsetlengthstringsegment
capacity_cannotchangeafterwritestarted
capacitycannotchangeafterwritestarted
capacity_notenough
capacitynotenough
capacity_notusedentirely
capacitynotusedentirely
Argument_InvalidOffsetLength
Argument_InvalidOffsetLengthStringSegment
Capacity_CannotChangeAfterWriteStarted
Capacity_NotEnough
Capacity_NotUsedEntirely
ThrowInvalidOperationException
InvalidOperationException
Push
newScope
s.StartsWith("[N")
WinBuiltinDCOMUsersSid
WinBuiltinIUsersSid
WinIUserSid
Avoids
uses
Matching
provides
logValues
provide
equal
UriParser
newline
RemoveType
directory
QueryPDBNameExW
SafeWaitHandle.ctor
converted
??
EnsureCallbacksInitialized
ISite
Site
Disposed
Components
gethashcode
_lasttimeunit
lasttimeunit
_samplecount
samplecount
_strallocheap
strallocheap
onDeclare
Test
IsLastSegment
ColdRVA
beginsWith
int32
alphabetical
first
SetDisposable
i--
concatenate
concatenation
ScopeId
GetAddressBytes
RyuJIT
optimizes
ROL
ValueCollection
_allocheap
_countsamples
_idealprocno
segmentsPatternEndsWith
nativeError
ticks
Day
Obsolete
obsolete
valueType
originalIssuer
MaxBufferSize
EndEdit
IRevertibleChangeTracking
RejectChanges
IntegratedWindowsAuthentication
calling
_disposedsentinel
disposedsentinel
GetFileName
windowsuserclaim
X500DistinguishedName
x500distinguishedname
ClaimValueTypes
Base64Binary
www
w3
RightShift
resourceFormat
Aggregate
ModuleResolveEventHandler
RequiresUnreferencedCodeAttribute
trimming
nameof(samples)
takes
mask
them
Build
matched
searching
globbing
CALLCONV
CC_CDECL
CC_MACPASCAL
CC_STDCALL
CC_RESERVED
writeline
startOfChecksumTableOffset
readline
(s
sr.readline())
Advance
GetMemory
Convert
ReadInt32
delay
_stringTableToOffsetMapping.ContainsKey(str)
checksumtype
DataMisalignedException.ctor
_pdbExtraData.HasFlag(PDBExtraData.kPDBLines)
previously
another
then
original
CV_SIGNATURE_C13
DEBUG_S_SUBSECTION_TYPE
DEBUG_S_IGNORE
x80000000
OpenModW
comparing
skipped
since
content
MaxOpaqueLength
AceFlags
IsGenericType
ProcessGenericType
BitArray.ctor
process
update
upon
registering
NotModified
UseProxy
PushDataFrame
frame
(aggregatedSampleCount[lastProcIndex])++
GetErrors
propertyName
INotifyPropertyChanging
PropertyChangingEventHandler
bug
desired
negative
MemoryManager
MemoryHandle
Pin
elementIndex
TryGetArray
ProcessArrayType
DisplayNameOptions
IsArray
valueArray
segmentsPatternStartsWith
strAfterTID.StartsWith("total:
")
concurrentdictionary
TrimEnd
amd64
TypeResolve
UnhandledExceptionEventHandler
eventName
EventName
ArgumentException
changes
documentOther
InitSampleInfoPassZero
strLastTID
ngenPdbWriter
includePatterns
PortableExecutable
Indicates
pro
actively
totalNodesRead++
switch
many
efficient
way
substring
methodInfo
State
passed
unregister
CopyBlockUnaligned
Failure
SafeFileHandle.ctor
CloseStatusDescription
formatted
changed
spliting
location
determination
delegated
failure
functions
112
numa
float
ReadSingle
getadjustedprocindex
WaitHandle
CreateWaitHandle
TryAdd
RegisterChangeTokenCallback
SampleInfo.ctor
iterate
ShadowCopyFiles
currentGCAllocMBAllHeaps
Registers
CreatePatternContextForExclude
totalAllocThreads++
strAfterTID.StartsWith("qpf")
ctor
descending
imported
coClass
CoClass
CollectionsMarshal
IMUsed
FillBuffer
AccessMask
exclude
patterns
exe
abstraction
arg3
GetKeyForItem
KeyedCollection.ctor
our
coding
convention
tabs
spaces
fix
settings
ClearItems
Patterns
Initialize
Marshal.FinalReleaseComObject(_ngenWriter)
It
matter
s.StartsWith("[")
GetStringComparer
_SegmentGroupIndex
LINEARPATTERN
Immutable
RAGGEDPATTERN
Concurrent
ConcurrentDictionary
INMEMORYFILEINFO
UnhandledExceptionEventArgs
asynchronous
_Flags
_IdealProcNo
accessor
dia
pdb
f
logging
found
audit
RECURSIVEWILDCARDSEGMENT
pdbFilePath
tempSourceDllName
_DeclaredParentPathSegment
_DeclaredWildcardPathSegment
_last
_sample
_str
_Parent
import
resolver
search
sec
contrib
characteristics
reloc
print
producer
PATTERNCONTEXTRAGGEDEXCLUDE
_DirectorySeparators
ace
SusingResourceKeys
OnChangeDelegate
_SegmentGroup
symbols
pb
ArgumentInvalidOffsetLength
ArgumentInvalidOffsetLengthStringSegment
CapacityCannotChangeAfterWriteStarted
CapacityNotEnough
CapacityNotUsedEntirely
_FileInfo
HASHHELPERS
MATCHER
PATTERNTESTRESULT
buffers
INMEMORYDIRECTORYINFO
DIRECTORYINFOWRAPPER
_Stack
_Frame
close
structural
comparisons
PATTERNCONTEXTLINEARINCLUDE
FILEINFOWRAPPER
PATTERNMATCHINGRESULT
_FLogging
editable
symDocuments
stringTableToOffsetMapping
documentToChecksumOffsetMapping
_DeclaredLiteralFolderSegmentInString
_DeclaredLiteralFolderSegments
_DeclaredLiteralFileSegments
handler
_SegmentIndex
_InStem
_StemItems
hash
helpers
_IncludePatterns
_ExcludePatterns
_Builder
_Comparison
SYMDOCUMENT
PATTERNCONTEXTRAGGEDINCLUDE
ds
_Failed
DisposedSentinel
PARENTPATHSEGMENT
ignore
_S_usingResourceKeys
component
principal
hybrid
keyed
_Tid
_AllocHeap
_CountSamples
w
module
_MatchAll
opaque
CURRENTPATHSEGMENT
_BacktrackAvailable
Sr
mapped
_Root
_IncludePatternContexts
_ExcludePatternContexts
observable
currentValue
currentKey
LITERALPATHSEGMENT
MATCHERCONTEXT
ideal
helper
marshal
PATTERNCONTEXTLINEAREXCLUDE
tracking
_DirectoryInfo
_IsParentPath
MATCHEREXTENSIONS
pdbMod
ngenWriter
PATTERNBUILDER
misaligned
WILDCARDPATHSEGMENT
receive
_Slashes
_Star
STRINGCOMPARISONHELPER
